nxp-mcuxpresso/mcux-sdk-examples/frdmrw612/edgefast_bluetooth_examples/wifi_cli_over_ble_wu/pin_mux.h
/*
 * Copyright 2024 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIO_11 (coord M2), button
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_button_PERIPHERAL GPIO      /*!<@brief Peripheral name */
#define BOARD_INITPINS_button_SIGNAL PIO0          /*!<@brief Signal name */
#define BOARD_INITPINS_button_CHANNEL 11           /*!<@brief Signal channel */
#define BOARD_INITPINS_button_GPIO GPIO            /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_button_GPIO_PIN 11U         /*!<@brief GPIO pin number */
#define BOARD_INITPINS_button_PORT 0U              /*!<@brief PORT number */
#define BOARD_INITPINS_button_PIN 11U              /*!<@brief PORT pin number */
#define BOARD_INITPINS_button_PIN_MASK (1U << 11U) /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
